#Σε έναν αθλητικό διαγωνισμό άλματος εις ύψος συμμετείχαν 40 αθλητές παγκόσμιας φήμης. Από αυτούς προκρίθηκαν στον δεύτερο γύρο όσοι έκαναν επίδοση μεγαλύτερη απο 2.25 μ. 
#Να γραφεί αλγόριθμος ο οποίος: 
#α) Να διαβάζει την επίδοση κάθε αθλητή
#β) Να υπολογίζει το πλήθος και το ποσοστό αυτών που πέρασαν στον δεύτερο γύρο
#γ) Από αυτούς που προκρίθικαν στον δεύτερο γύρο, να εμφανίζει το ποσοστό αυτών που είχαν επίδοση μεγαλύτερη απο 2.3μ.
#Να μην γίνει έλεγχος τιμών εισόδου

pass1 = 0
pass2 = 0
for i in range (1,40):
    perf = input("Εισάγετε την επίδοση του αθλητή \n >>> ")
    perf=float(perf)
    if perf > 2.25:
        pass1+= 1
        if perf > 2.30:
            pass2+=1
p1p = (pass1/ 40 )*100
print("Πέρασαν το ",p1p,"% των αθλητών")
if pass1 !=0:
    p2p = (pass2 / pass1) *100
    print('Το ',p2p,'% πέρασε με απόσταση μεγαλύτερη των 2.3μ')
else:
    print("Σφάλμα υπολογισμού. Δεν υπήρξε καμία πρόκριση")
